app/Controllers/Auth.php

            'created_at'   => date('Y-m-d H:i:s'),
        ];

        $userId = $this->userModel->insert($data);
---
INSERT INTO `users` (`nama_lengkap`, `username`, `email`, `no_hp`, `password`, `role`, `status`, `created_at`, `updated_at`) VALUES ('Tiwi Aulia', 'tiwiaulia59', 'tiwiaulia59@gmail.com', '082345678901', '$2y$10$R.4CkiINWlXeIzAkoMt46Oh2Yu8jnp1F.pt9CMoWRtO7ilYhxQG/y', 'pengguna', 'aktif', '2026-06-14 05:46:57', '2026-06-14 05:46:57')