app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 6
---
    public function profil()
    {

        $userId = session()->get('user_id');
        $user   = $this->userModel->find($userId);

UPDATE `users` SET `nama_lengkap` = 'Tiwi Aulia', `no_hp` = '082345678901', `updated_at` = '2026-06-14 05:47:07'
WHERE `users`.`id` IN (6)
---
            $updateData['password'] = password_hash($pwBaru, PASSWORD_BCRYPT);
        }

        $this->userModel->skipValidation(true)->update($userId, $updateData);