app/Controllers/Home.php

    public function index(): string
    {
        $ratingInfo = $this->ratingModel->getAverageRating();
        $recentRatings = $this->ratingModel->getRatingsWithUser(5);
        $recentStores = $this->tokoModel->where('status', 'aktif')->orderBy('created_at', 'DESC')->limit(6)->findAll();

        $userReview = null;
        if (session()->get('is_logged_in')) {
            $userReview = $this->ratingModel->where('user_id', session()->get('user_id'))->first();
---
SELECT *
FROM `app_ratings`
WHERE `user_id` = 6
 LIMIT 1

    public function submitRating()
    {
        if (! session()->get('is_logged_in')) {
            return redirect()->to(base_url('auth/login'))->with('error', 'Silakan login terlebih dahulu untuk memberikan rating.');
        }

        $userId = session()->get('user_id');

        $existing = $this->ratingModel->where('user_id', $userId)->first();

        $rules = [
            'rating' => 'required|in_list[1,2,3,4,5]',
            'ulasan' => 'permit_empty|string',
        ];

        if (! $this->validate($rules)) {
            return redirect()->to(base_url('/#ulasan'))->withInput()->with('errors', $this->validator->getErrors());
        }

        if ($existing) {
            $this->ratingModel->update($existing['id'], [
                'rating'     => $this->request->getPost('rating'),
                'ulasan'     => $this->request->getPost('ulasan'),
                'updated_at' => date('Y-m-d H:i:s'),
            ]);
            return redirect()->to(base_url('/#ulasan'))->with('success', 'Ulasan Anda berhasil diperbarui!');
        } else {
            $this->ratingModel->insert([
                'user_id'    => $userId,
                'rating'     => $this->request->getPost('rating'),
                'ulasan'     => $this->request->getPost('ulasan'),
                'created_at' => date('Y-m-d H:i:s'),
            ]);
---
SELECT *
FROM `app_ratings`
WHERE `user_id` = 6
 LIMIT 1
INSERT INTO `app_ratings` (`user_id`, `rating`, `ulasan`, `created_at`) VALUES (6, '1', 'JELEK', '2026-06-14 05:47:23')