app/Models/RatingModel.php

    public function getRatingsWithUser($limit = 10)
    {
        return $this->select('app_ratings.*, users.nama_lengkap, users.foto_profil')
                    ->join('users', 'users.id = app_ratings.user_id')
                    ->orderBy('app_ratings.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `app_ratings`.*, `users`.`nama_lengkap`, `users`.`foto_profil`
FROM `app_ratings`
JOIN `users` ON `users`.`id` = `app_ratings`.`user_id`
ORDER BY `app_ratings`.`created_at` DESC
 LIMIT 5

    public function getAverageRating()
    {
        $result = $this->selectAvg('rating', 'avg_rating')
                       ->selectCount('id', 'total_reviews')
                       ->first();
---
SELECT AVG(`rating`) AS `avg_rating`, COUNT(`id`) AS `total_reviews`
FROM `app_ratings`
 LIMIT 1